# 12: Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.

# 4 4 -> 2 2
# 5 6 -> 2 3

import math

S = int(input("Введите сумму чисел (X + Y): "))
P = int(input("Введите произведение чисел (X * Y): "))

# X + Y = S      X = S - Y
# X * Y = P      P = (S - Y) * Y

# P = S * Y - 2 * Y
# P = Y * (S - Y)
# P = S * Y - Y^2
# Y^2 - S * Y + P = 0

D = S * S - 4 * P

if D < 0:
    print("Подсказки даны неверно!")
elif D == 0:
    X = Y = S/2
    print(f"{S} {P} -> {Y} {X}")
else:
    X = (S + math.sqrt(D))/2
    Y = (S - math.sqrt(D))/2
    print(f"{S} {P} -> {Y} {X}")